Revit 2027 API
BuiltInFailures.SketchFailures.StairNotEnoughBoundaryCurves Property
 Stairs require boundaries (chains of one or more Boundary Lines) on each side of the Stair.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairNotEnoughBoundaryCurves { get; }
Public Shared ReadOnly Property StairNotEnoughBoundaryCurves As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairNotEnoughBoundaryCurves {
	FailureDefinitionId^ get ();
}
static member StairNotEnoughBoundaryCurves : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace